# Работа с таблицами

In [1]:
# Создание таблицы использую примитивы Python
ar = [[1, 2], [3, 4]]
ar

[[1, 2], [3, 4]]

In [2]:
for i in range(len(ar)):
    print(ar[i])

[1, 2]
[3, 4]

In [3]:
for i in range(len(ar)):
    for j in range(len(ar[i])):
        print(ar[i][j])

1
2
3
4

# Pandas

In [4]:
# Обращение к системному пакетному менеджеру
# установка модуля pandas, флаг -q - тихая установка  
%pip install -q pandas
import pandas as pd

Note: you may need to restart the kernel to use updated packages.

In [5]:
sr = pd.Series([4, 5, 6.0]) # Создание одномерного массива
sr

0    4.0
1    5.0
2    6.0
dtype: float64

In [6]:
sr.sum() # получение суммы всех элементов, идентично sum(sr)

15.0

In [7]:
sr[0] # получение значения по идентификатору

4.0

# Dataframe

In [8]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]]) # Создание таблицы

   0  1  2
0  1  2  3
1  4  5  6

In [9]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], columns=['id', '1', 'b']) # Создание таблицы с именами стобцов
df

   id  1  b
0   1  2  3
1   4  5  6

In [10]:
df['id'] # Получение значений столбца

0    1
1    4
Name: id, dtype: int64

In [11]:
df[['id', '1']] # Получение значений по столбцам

   id  1
0   1  2
1   4  5

In [12]:
df[['id', 'b']].loc[1] # Получение значений по столбцам и строкам

id    4
b     6
Name: 1, dtype: int64

In [13]:
df = pd.DataFrame([[1, 2, 3], [5, 40, 220]], 
                  columns=['пешеход', 'авто', 'спорткар'], 
                  index=['время', 'скорость']) # Создание таблицы с другими идентификаторами
df

          пешеход  авто  спорткар
время           1     2         3
скорость        5    40       220

In [14]:
df.loc['скорость']

пешеход       5
авто         40
спорткар    220
Name: скорость, dtype: int64

In [15]:
df.info() # Получение информации о таблице

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, время to скорость
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   пешеход   2 non-null      int64
 1   авто      2 non-null      int64
 2   спорткар  2 non-null      int64
dtypes: int64(3)
memory usage: 172.0+ bytes

In [16]:
df.transpose() # Транспонирование (поворот - столбцы -> индексы, индексы -> столбцы) таблицы(матрицы)

          время  скорость
пешеход       1         5
авто          2        40
спорткар      3       220

In [17]:
# Создание таблицы из словарей
df = pd.DataFrame([{'id': 1, 'a': 2, 'b': 3}, {'id': 4, 'a': 5, 'b': 6}])
df

   id  a  b
0   1  2  3
1   4  5  6

In [18]:
# Создание таблицы из словарей с различными ключами, NaN - Not a Number
df = pd.DataFrame([{'id': 1, 'a': 2, 'b': 3}, {'id': 4, 'a': 5, 'c': 6}])
df

   id  a    b    c
0   1  2  3.0  NaN
1   4  5  NaN  6.0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      2 non-null      int64
 1   a       2 non-null      int64
 2   b       1 non-null      float64
 3   c       1 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 192.0 bytes

# Rename axis

In [20]:
df = pd.DataFrame([{'id': 1, 'Название': 2}, 
                   {'id': 3, 'Название': 4, 'Стоимость': 4},
                   {'id': 5, 'Название': 6, 'Стоимость': 7},
                   {'id': 8, 'Название': 9, 'Стоимость': 10}])
df

   id  Название  Стоимость
0   1         2        NaN
1   3         4        4.0
2   5         6        7.0
3   8         9       10.0

In [21]:
df.rename({'Название': 'name', 'Стоимость': 'price'}, axis=1) # Переименование столбца

   id  name  price
0   1     2    NaN
1   3     4    4.0
2   5     6    7.0
3   8     9   10.0

In [22]:
df.rename({0: 'a'}, axis=0) # Переименование индекса

   id  Название  Стоимость
a   1         2        NaN
1   3         4        4.0
2   5         6        7.0
3   8         9       10.0

# Set index

In [23]:
df.set_index('id') # Использование столбца как идентификатор

    Название  Стоимость
id
1          2        NaN
3          4        4.0
5          6        7.0
8          9       10.0

In [24]:
df.set_index(['id', 'Название']) # Использование композитного идентификатора

             Стоимость
id Название
1  2               NaN
3  4               4.0
5  6               7.0
8  9              10.0

# Statistics

In [25]:
df = pd.DataFrame([{'id': 1, 'b': 2}, 
                   {'id': 3, 'a': 4},
                   {'id': 5, 'a': 6, 'b': 7},
                   {'id': 8, 'a': 9, 'b': 10}])
df

   id     b    a
0   1   2.0  NaN
1   3   NaN  4.0
2   5   7.0  6.0
3   8  10.0  9.0

In [26]:
df.sum()

id    17.0
b     19.0
a     19.0
dtype: float64

In [27]:
df['b'].sum()

19.0

In [28]:
df.mean()

id    4.250000
b     6.333333
a     6.333333
dtype: float64

In [29]:
df.count()

id    4
b     3
a     3
dtype: int64

In [30]:
df.median()

id    4.0
b     7.0
a     6.0
dtype: float64

In [31]:
df.max()

id     8.0
b     10.0
a      9.0
dtype: float64

In [32]:
df['b'].max()

10.0

In [33]:
df.min()

id    1.0
b     2.0
a     4.0
dtype: float64

In [34]:
df.mode()

   id     b    a
0   1   2.0  4.0
1   3   7.0  6.0
2   5  10.0  9.0
3   8   NaN  NaN

In [35]:
df['a'].mode()

0    4.0
1    6.0
2    9.0
Name: a, dtype: float64

In [36]:
pd.DataFrame([{'a': 4, 'b': 2}, 
                   {'a': 4},
                   {'a': 6, 'b': 7},
                   {'a': 9, 'b': 10}]).mode()

     a     b
0  4.0   2.0
1  NaN   7.0
2  NaN  10.0

In [37]:
pd.DataFrame([{'a': 4, 'b': 2}, 
                   {'a': 4},
                   {'a': 6, 'b': 7},
                   {'a': 9, 'b': 10}])['a'].mode()

0    4
Name: a, dtype: int64

# Work with NaN

In [38]:
df = pd.DataFrame([{'id': 1, 'b': 2}, 
                   {'id': 3, 'a': 4},
                   {'id': 5, 'a': 6, 'b': 7},
                   {'id': 8, 'a': 9, 'b': 11}])
df

   id     b    a
0   1   2.0  NaN
1   3   NaN  4.0
2   5   7.0  6.0
3   8  11.0  9.0

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      int64
 1   b       3 non-null      float64
 2   a       3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

In [40]:
df.notna() # Преобразоватние таблицы, где NaN будет False, остальное - True

     id      b      a
0  True   True  False
1  True  False   True
2  True   True   True
3  True   True   True

In [41]:
df.isna() # Преобразоватние таблицы, обратное notna

      id      b      a
0  False  False   True
1  False   True  False
2  False  False  False
3  False  False  False

In [42]:
df.notna().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      bool
 1   b       4 non-null      bool
 2   a       4 non-null      bool
dtypes: bool(3)
memory usage: 140.0 bytes

In [43]:
df['b'].notna()

0     True
1    False
2     True
3     True
Name: b, dtype: bool

In [44]:
df.fillna(0) # Заполнить все NaN на 0

   id     b    a
0   1   2.0  0.0
1   3   0.0  4.0
2   5   7.0  6.0
3   8  11.0  9.0

In [45]:
df.fillna(df['b'].mean()) # Заполнить все NaN средним значением из столбца b, но NaN в столбце a тоже изменятся

   id          b         a
0   1   2.000000  6.666667
1   3   6.666667  4.000000
2   5   7.000000  6.000000
3   8  11.000000  9.000000

In [46]:
df['b'] = df['b'].fillna(df['b'].mean()) # Заполнить средним значением b, все NaN в столбце b, но данный столбец будет перезаписан
df

   id          b    a
0   1   2.000000  NaN
1   3   6.666667  4.0
2   5   7.000000  6.0
3   8  11.000000  9.0

In [47]:
df = pd.DataFrame([{'id': 1, 'b': 2}, 
                   {'id': 3, 'a': 4},
                   {'id': 5, 'a': 6, 'b': 7},
                   {'id': 8, 'a': 9, 'b': 11}])
df

   id     b    a
0   1   2.0  NaN
1   3   NaN  4.0
2   5   7.0  6.0
3   8  11.0  9.0

In [48]:
df.fillna(df.mean()) # NaN заполнятся средним значением по своему столбцу

   id          b         a
0   1   2.000000  6.333333
1   3   6.666667  4.000000
2   5   7.000000  6.000000
3   8  11.000000  9.000000

pad / ffill - заполнить значением выше

bfill / backfill - заполнить значением ниже

In [49]:
df.fillna(method="ffill") # или df.ffill()

   id     b    a
0   1   2.0  NaN
1   3   2.0  4.0
2   5   7.0  6.0
3   8  11.0  9.0

In [50]:
df.ffill()

   id     b    a
0   1   2.0  NaN
1   3   2.0  4.0
2   5   7.0  6.0
3   8  11.0  9.0

In [51]:
df.bfill()

   id     b    a
0   1   2.0  4.0
1   3   7.0  4.0
2   5   7.0  6.0
3   8  11.0  9.0

In [52]:
df = df.bfill() # Заполняем и перезаписываем данные
df

   id     b    a
0   1   2.0  4.0
1   3   7.0  4.0
2   5   7.0  6.0
3   8  11.0  9.0

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      int64
 1   b       4 non-null      float64
 2   a       4 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

In [54]:
df['a'] = df['a'].astype(int) # Приведение типа
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      int64
 1   b       4 non-null      float64
 2   a       4 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 224.0 bytes